# SetCombinedParameters Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..SetCombinedParameters Method
ScheduleField Class See Also
---
Sets this field's combine parameter array if applicable
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetCombinedParameters(
	IList<TableCellCombinedParameterData> data
)
```

Visual Basic
---
```text
Public Sub SetCombinedParameters ( _
	data As IList(Of TableCellCombinedParameterData) _
)
```

Visual C++
---
```text
public:
void SetCombinedParameters(
	IList<TableCellCombinedParameterData^>^ data
)
```

# ### Parameters
data
    Type: System.Collections.Generic..::..IList<(Of <(<'TableCellCombinedParameterData>)>)> data is array of TableCellCombinedParameterData to be set as combined parameters
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace